myamazum/stampfly_ecosystem/firmware/workshop/sdkconfig.defaults
# StampFly RTOS Skeleton - Default SDK Configuration
# Target: ESP32-S3 (M5StampS3)

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# USB CDC Console (required for esp_vfs_dev_cdcacm_* functions in CLI)
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# System Event Task (increase stack size to prevent overflow with WiFi)
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# WiFi for ESP-NOW and Telemetry
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_IRAM_OPT=y

# HTTP Server (WebSocket support for telemetry)
CONFIG_HTTPD_WS_SUPPORT=y

# NVS
CONFIG_NVS_DEFAULT_PART_SIZE=0x6000

# SPI
CONFIG_SPI_MASTER_IN_IRAM=y

# I2C
CONFIG_I2C_ISR_IRAM_SAFE=y

# GPIO
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y

# LEDC (PWM)
CONFIG_LEDC_CTRL_FUNC_IN_IRAM=y

# RMT (for WS2812)
CONFIG_RMT_ISR_IRAM_SAFE=y

# C++ exceptions (required by stampfly_opticalflow)
CONFIG_COMPILER_CXX_EXCEPTIONS=y
